/**
 * @file board_pinout.h
 * @brief ESP32-C3开发板接口定义和引脚说明
 * @note 原始开发板接口定义
 */

#ifndef BOARD_PINOUT_H
#define BOARD_PINOUT_H

#ifdef __cplusplus
extern "C" {
#endif

/* ESP32-C3开发板接口定义
 *
 * ┌─────────────────────────────────────────────────────────────────────────────────────────┐
 * │ 编号 │  名称   │        复位后默认功能       │     复用功能     │   电源域    │ 上下拉能力  │
 * ├──────┼─────────┼───────────────────────────┼─────────────────┼─────────────┼────────────┤
 * │  1   │  GND    │            接地           │                  │             │            │
 * │  2   │  IO00   │  GPIO0,输入，输出，高阻    │ UART1_TX/ADC_0   │ VDD3P3_CPU  │  UP/DOWN   │
 * │  3   │  IO01   │  GPIO1,输入，输出，高阻    │ UART1_RX/ADC_1   │ VDD3P3_CPU  │  UP/DOWN   │
 * │  4   │  IO12   │  GPIO12,输入，输出，高阻   │     SPIHD        │ VDD3P3_CPU  │  UP/DOWN   │
 * │  5   │  IO18   │  GPIO18,输入，输出，高阻   │    USB_D-        │ VDD3P3_CPU  │  UP/DOWN   │
 * │  6   │  IO19   │  GPIO19,输入，输出，高阻   │    USB_D+        │ VDD3P3_CPU  │  UP/DOWN   │
 * │  7   │  GND    │            接地           │                  │             │            │
 * │  8   │ U0_RX   │  GPIO20,输入，输出，高阻   │    UART0_RX      │ VDD3P3_CPU  │  UP/DOWN   │
 * │  9   │ U0_TX   │  GPIO21,输入，输出，高阻   │    UART0_TX      │ VDD3P3_CPU  │  UP/DOWN   │
 * │ 10   │  IO13   │  GPIO13,输入，输出，高阻   │                  │ VDD3P3_CPU  │  UP/DOWN   │
 * │ 11   │   NC    │                           │                  │             │            │
 * │ 12   │ RESET   │          芯片复位          │                  │ VDD3P3_RTC  │            │
 * │ 13   │  3.3V   │       芯片电源，3.3V       │                  │             │            │
 * │ 14   │  GND    │            接地           │                  │             │            │
 * │ 15   │  PWB    │ 芯片3.3V供电控制,高电平有效 │                  │             │            │
 * │      │         │      不用可悬空            │                  │             │            │
 * │ 16   │   5V    │ 5V电源接口，与USB的VBUS相连 │                  │             │            │
 * │ 17   │  GND    │            接地            │                  │             │            │
 * │ 18   │  3.3V   │       芯片电源，3.3V       │                  │             │            │
 * │ 19   │  IO02   │  GPIO02,输入，输出，高阻   │  SPI2_CK/ADC_2   │ VDD3P3_CPU  │  UP/DOWN   │
 * │ 20   │  IO03   │  GPIO03,输入，输出，高阻   │ SPI2_MOSI/ADC_3  │ VDD3P3_RTC  │  UP/DOWN   │
 * │ 21   │  IO10   │  GPIO10,输入，输出，高阻   │   SPI2_MISO      │ VDD3P3_CPU  │  UP/DOWN   │
 * │ 22   │  IO06   │  GPIO06,输入，输出，高阻   │                  │ VDD3P3_CPU  │  UP/DOWN   │
 * │ 23   │  IO07   │  GPIO07,输入，输出，高阻   │    SPI2_CS       │ VDD3P3_CPU  │  UP/DOWN   │
 * │ 24   │ PB_11   │  GPIO11,输入，输出，高阻   │    VDD_SPI       │ VDD3P3_CPU  │  UP/DOWN   │
 * │ 25   │  GND    │            接地           │                  │             │            │
 * │ 26   │  3.3V   │       芯片电源，3.3V       │                  │             │            │
 * │ 27   │  IO05   │  GPIO05,输入，输出，高阻    │  I2C_SCL/ADC_5   │ VDD3P3_RTC  │  UP/DOWN   │
 * │ 28   │  IO04   │  GPIO04,输入，输出，高阻    │  I2C_SDA/ADC_4   │ VDD3P3_RTC  │  UP/DOWN   │
 * │ 29   │  IO08   │  GPIO08,输入，输出，高阻    │                  │ VDD3P3_CPU  │  UP/DOWN   │
 * │ 30   │  BOOT   │      GPIO09,输入           │    BOOTMODE      │ VDD3P3_CPU  │  UP/DOWN   │
 * │ 31   │   5V    │ 5V电源接口，与USB的VBUS相连 │                  │             │            │
 * │ 32   │  GND    │            接地            │                  │             │            │
 * └───────────────────────────────────────────────────────────────────────────────────────────┘
 *
 * ┌───────────────────────────────────────────────┐
 * │ LED编号 │ 对应GPIO │  管脚功能   │    描述      │
 * ├─────────┼──────────┼─────────────┼────────────┤
 * │   D4    │  IO12    │ GPIO12配置  │  高电平有效 │
 * │   D5    │  IO13    │ GPIO13配置  │  高电平有效 │
 * └───────────────────────────────────────────────┘
 *
 * ┌─────────────────────────────────────────────────────────┐
 * │  按键编号   │          管脚功能           │      描述     │
 * ├─────────────┼────────────────────────────┼──────────────┤
 * │ BOOT/GPIO9  │ 按键按下时，芯片进入下载模式  │   低电平有效  │
 * │    RST      │    按键按下时，芯片复位      │   低电平有效  │
 * └─────────────────────────────────────────────────────────┘
 *
 * ┌────────────────────────────────────────────────────────────────────┐
 * │ flash管脚标号  │ 对应GPIO │        管脚功能              │ 上下拉能力 │
 * ├───────────────┼──────────┼─────────────────────────────┼───────────┤
 * │    SPICS0     │    -     │ GPIO14配置，FLASH_CS，片选   │ UP/DOWN   │
 * │     SPIQ      │    -     │ GPIO17配置，FLASH_D1，数据脚1│ UP/DOWN   │
 * │     SPID      │    -     │ GPIO16配置，FLASH_D0，数据脚0│ UP/DOWN   │
 * │    SPICLK     │    -     │ GPIO15配置，FLASH_CK，时钟   │ UP/DOWN   │
 * └────────────────────────────────────────────────────────────────────┘
 */

/* 注意：
 * 1. BOOT（IO09）管脚上电前不能下拉，ESP32会进入下载模式。
 * 2. 使用到IO08管脚进行设计，不建议外部直接下拉，因为在下载烧录时，IO08管脚为低电平，不能使用串口进行下载。
 * 3. IO12（GPIO12）、IO13（GPIO13）在QIO模式下为SPI信号SPIHD和SPIWP复用，为了增加可用GPIO数量，开发板选择采用2线SPI的DIO模式，IO12、IO13并未连接flash，使用自己编译的软件时需要注意配置flash为DIO模式。
 * 4. 外置SPI flash的VDD已链接至3.3V电源系统，使用时不需再配置其他电源，采用普通2线SPI通信方式，对应管脚如表4-3。
 * 5. GPIO11默认为SPI flash的VDD引脚，需要配置后才能作为GPIO使用。
 * 6. 任意GPIO均可作为PWM脚, 编号与GPIO一致, 但同时只能开启4路PWM
 * 7. 日志波特率为921600
 */

#ifdef __cplusplus
}
#endif

#endif // BOARD_PINOUT_H
